app/controllers/episodios_controller.rb

SELECT * FROM "episodios"
---
  def index
    @episodios = Episodio.all(:order => "numero DESC, parte DESC")

SELECT * FROM "episodios" WHERE ("episodios"."id" = 0)
---
  def show

    #break number appart into numero/parte
    parts = params[:id].scan(/[a-zA-Z]+|[0-9]+/)

    #search by number or number+part
    if parts.size() < 2
      @episodio = Episodio.first(:conditions => ["numero = ?", parts.shift])
    else
      @episodio = Episodio.first(:conditions => ["numero = ?", parts.shift], :conditions => ["parte = ?", parts.shift])
    end

    #None found, search by ID
    if @episodio.nil?
      @episodio = Episodio.find(params[:id])

SELECT * FROM "episodios" WHERE ("episodios"."id" = 1)
---
  def edit
    @episodio = Episodio.find(params[:id])

INSERT INTO "episodios" ("imagem", "created_at", "titulo", "updated_at", "numero", "desc", "link") VALUES('http://jovemnerd.ig.com.br/wordpress/wp-content/2006/04/009_tit.jpg', '2009-10-17 13:05:55', 'O NerdCast', '2009-10-17 13:05:55', 1, '-Primeiro nerdcast com a vinheta nova.
---
  def create
    @episodio = Episodio.new(params[:episodio])

    respond_to do |format|
      if @episodio.save

SELECT * FROM "episodios" WHERE ("episodios"."id" = 2053932785)
---
  def update
    @episodio = Episodio.find(params[:id])

SELECT * FROM "episodios" WHERE ("episodios"."id" = 2053932785)
---
  def destroy
    @episodio = Episodio.find(params[:id])