app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.all
---
SELECT * FROM "quotes"

  def show
    @quote = Quote.find(params[:id])
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 1)

  def edit
    @quote = Quote.find(params[:id])
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 2053932785)

  def create
    @quote = Quote.new(params[:quote])

    @quote.user_id = current_user.id

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("episodio_id", "created_at", "autor", "updated_at", "time", "user_id", "quote") VALUES(1, '2009-10-19 02:08:44', 'alotoni', '2009-10-19 02:08:44', '00:00:00', 3, 'asdadsdsa')

  def update
    @quote = Quote.find(params[:id])
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 2053932785)

  def destroy
    @quote = Quote.find(params[:id])

    only_owner(@quote)

    @quote.destroy
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 2053932785)
DELETE FROM "quotes" WHERE "id" = 2053932785