app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT * FROM "tracks"

  def show
    @track = Track.find(params[:id])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 1)

  def edit
    @track = Track.find(params[:id])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 2053932785)

  def create
    @track = Track.new(params[:track])

    @track.user_id = current_user.id

    @track.time = "%02d:%02d:%02d" % [ params[:track_timeh], params[:track_timem], params[:track_times] ]

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("episodio_id", "created_at", "updated_at", "time", "user_id", "link", "song") VALUES(NULL, '2009-10-17 18:02:15', '2009-10-17 18:02:15', '00:00:00', NULL, 'link.com', 'song')

  def update
    @track = Track.find(params[:id])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 2053932785)

  def destroy
    @track = Track.find(params[:id])
    @track.destroy
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 2053932785)
DELETE FROM "tracks" WHERE "id" = 2053932785