app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 4)
UPDATE "users" SET "updated_at" = '2009-11-06 13:33:44', "admin" = 't' WHERE "id" = 4
---
  def admintoggle
    @user = User.find(params[:id])

    @user.admin = !@user.admin?

    respond_to do |format|
      if @user.save